---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor(Autodesk.Revit.DB.IFC.IFCGuidKey)
source: html/20626e5a-9b2c-7281-2645-357cec7f6481.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.#ctor Method

IFCGuidKey can be used in managed code as well as unmanaged.

## Syntax (C#)
```csharp
public IFCGuidKey(
	IFCGuidKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.IFC.IFCGuidKey`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null